// Магазин предлагает 2 размера мороженого:
// Маленький стакан (10грн)
// Большой стакан (25грн). 
//      Мороженое дополняется одной или несколькими начинками (минимум - одной):
// -шоколад (+5грн);
// -карамель (+6грн);
// -ягоды (+10грн).
// ------ Дополнительно (не обязательно) мороженое можно посыпать маршмеллоу (+5грн).
// Входящие параметры пользователь вводит через prompt.

let size: string = prompt("Якого розміру морозиво ви бажаєте? 1 - Маленьке (10грн) | 2 - Велике (25грн). Введіть обране число: ");
let sum: number = 0;

if(!size){
    size = prompt("Оберіть, будь ласка розмір морозива.");
}


if (+size == 1){
    sum += 10;
}
else if(+size == 2){
    sum += 25;
}
else{
    size = prompt("Оберіть, будь ласка розмір морозива.");
}


    let a: string = prompt("Оберіть начинку: 1 - шоколад | 2 - карамель | 3 - ягоди");

    switch (a) {
        case "1":
            {
                sum += 5;
            }
            break;
        case "2":
            {
                sum += 6;
            }
            break;
        case "3":
            {
                sum += 10;
            }
            break;
        default:
            {
                sum += 5;
                alert("Ми додали в морозиво шоколадну крихту.");
            }
            break;
    }

    alert(`Сума замовлення складає ${sum} грн.`);
